app/views/conversations/_conversation.html.erb

SELECT  "personal_messages".* FROM "personal_messages" WHERE "personal_messages"."conversation_id" = ? ORDER BY "personal_messages"."created_at" DESC LIMIT ?  [["conversation_id", 1], ["LIMIT", 1]]
---
	<br>
	<em><%= conversation.personal_messages.last.body.truncate(50) %></em>