app/controllers/conversations_controller.rb

SELECT "conversations".* FROM "conversations" WHERE ((conversations.author_id = 1 OR conversations.receiver_id = 1)) ORDER BY updated_at DESC
---
	def index
		@conversations = Conversation.participating(current_user).order('updated_at DESC')

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def find_conversation!
		if params[:receiver_id]
			@receiver = User.find_by(id: params[:receiver_id])
			redirect_to(root_path) and return unless @receiver
			@conversation = Conversation.between(current_user.id, @receiver.id)[0]
		else
			@conversation = Conversation.find_by(:id params[:conversation_id])