app/controllers/personal_messages_controller.rb

INSERT INTO "conversations" ("author_id", "receiver_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["author_id", 1], ["receiver_id", 1], ["created_at", 2016-11-11 23:36:38 UTC], ["updated_at", 2016-11-11 23:36:38 UTC]]
INSERT INTO "personal_messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "yo yo"], ["conversation_id", 2], ["user_id", 1], ["created_at", 2016-11-12 00:18:38 UTC], ["updated_at", 2016-11-12 00:18:38 UTC]]
---
	def create
		@conversation ||= Conversation.create(author_id: current_user.id,
											  receiver_id: @receiver.id)
		@personal_message = current_user.personal_messages.build(personal_message_params)
		@personal_message.conversation_id = @conversation.id
		puts "online_stat********"
		@personal_message.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def find_conversation!
		if params[:receiver_id]
			@receiver = User.find_by(id: params[:receiver_id])
			redirect_to(root_path) and return unless @receiver
			@conversation = Conversation.between(current_user.id, @receiver_id)[0]
		else
			@conversation = Conversation.find_by(id: params[:conversation_id])